20240126053634-adding_constructors_fields_and_methods_to_enums.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Adding Constructors, fields and methods to Enums</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Adding Constructors, fields and methods to Enums</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2aa6c61">1. Adding Constructors, fields and methods to Enums</a>
<ul>
<li><a href="#orgf629a8b">1.1. Example</a></li>
<li><a href="#org1fc9eaf">1.2. Example</a></li>
<li><a href="#org715b1e7">1.3. Defining different methods for each Enum</a>
<ul>
<li><a href="#org511b18a">1.3.1. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2aa6c61" class="outline-2">
<h2 id="org2aa6c61"><span class="section-number-2">1.</span> Adding Constructors, fields and methods to Enums</h2>
<div class="outline-text-2" id="text-1">
<p>
While a <a href="20240126053557-creating_simple_enums.html#ID-44a16f84-0d2c-4f42-8f51-d24f8985e648">simple enum</a> is composed of just a list of values, we can define a <b>complex</b> enum with additional elements.
</p>
</div>

<div id="outline-container-orgf629a8b" class="outline-3">
<h3 id="orgf629a8b"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Let’s say our zoo wants to keep track of traffic patterns to determine which seasons get the most visitors.
</p>

<div class="org-src-container">
<pre class="src src-java">public enum Season{
    WINTER("Low"), SPRING("High"), SUMMER("Medium"), Fall("Low");

    private final String humidity;

    private Season(String humidity) {
        this.humidity = humidity;
    }

    public void printHumidity() {
        System.out.println("Humidity " + humidity);
    }
}

</pre>
</div>

<p>
On <code>line 2</code>, the list of <code>enum</code> values ends with a <b>semicolon (;)</b>.
</p>

<p>
While this is <b>optional</b> when our enum is composed solely of a list of values (simple enum), it is <b>required</b> if there is anything in the enum besides the values.
</p>

<p>
<code>Lines 3–9</code> are regular Java code.
We have an <code>instance variable</code>, a <code>constructor</code>, and a <code>method</code>.
</p>

<p>
We mark the instance variable <code>private</code> and <code>final</code> on <code>line 3</code> so that our enum properties <b>cannot</b> be modified.
</p>

<p>
All <code>enum</code> <code>constructors</code> are <b>implicitly</b> <code>private</code>, with the modifier being <b>optional</b>.
</p>

<p>
This is reasonable since you <b>can’t</b> extend an enum and the <code>constructors</code> can be called only within the enum itself.
</p>

<p>
In fact, an <code>enum</code> <code>constructor</code> will not compile if it contains a <code>public</code> or <code>protected</code> modifier.
</p>

<p>
The parentheses on <code>line 2</code> are are constructor calls, but <b>without</b> the <code>new</code> keyword normally used for objects.
</p>
</div>
</div>

<div id="outline-container-org1fc9eaf" class="outline-3">
<h3 id="org1fc9eaf"><span class="section-number-3">1.2.</span> Example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The first time we ask for any of the enum values, Java constructs <b>all</b> of the enum values.
After that, Java just returns the <b>already</b> constructed <code>enum values</code>.
</p>

<p>
Given that explanation, you can see why this calls the constructor <b>only once</b>:
</p>

<div class="org-src-container">
<pre class="src src-java">public enum OnlyOne {
    ONCE(true);
    private OnlyOne(boolean b) {
        System.out.print("constructing,");
    }
}
public class PrintTheOne {
    public static void main(String[] args) {
        System.out.print("begin,");
        OnlyOne firstCall = OnlyOne.ONCE; // Prints constructing,
        OnlyOne secondCall = OnlyOne.ONCE; // Doesn't print anything
        System.out.print("end");
    }
}
</pre>
</div>


<p>
This class prints the following: <code>begin,constructing,end</code>
</p>
</div>
</div>

<div id="outline-container-org715b1e7" class="outline-3">
<h3 id="org715b1e7"><span class="section-number-3">1.3.</span> Defining different methods for each Enum</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-java">public enum Season {
    WINTER {
        public String getHours() { return "10am-3pm"; }
    },
    SPRING {
        public String getHours() { return "9am-5pm"; }
    },
    SUMMER {
        public String getHours() { return "9am-7pm"; }
    },
    FALL {
        public String getHours() { return "9am-5pm"; }
    };
    public abstract String getHours();
</pre>
</div>
</div>

<div id="outline-container-org511b18a" class="outline-4">
<h4 id="org511b18a"><span class="section-number-4">1.3.1.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
An enum can even implement an <code>interface</code>, as this just requires <b>overriding</b> the abstract methods:
</p>

<div class="org-src-container">
<pre class="src src-java">public interface Weather { int getAverageTemperature(); }

public enum Season implements Weather {
    WINTER,
    SPRING,
    SUMMER {
        @Override
        public int getAverageTemperature() {
            return 50;
        }
    },
    Fall;
    public int getAverageTemperature(){
        return 30;
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
